Autodesk.Revit.UI.ProjectBrowserDataProvider.SetActiveTab(Autodesk.Revit.DB.Document,System.Int32)
set active Tab
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.IsTabEnable
Returns if project browser Tab is enabled
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.IsAddinPBEnable
Returns if web project browser is enabled
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.CreateContextMenu(Autodesk.Revit.DB.Document,System.Boolean)
create context menu
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.EndLabelEdit(Autodesk.Revit.DB.Document,System.Int32,System.String)
End tree item name editing
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.Rename
Rename tree item
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.UpdateBrowserData(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.ShouldRefreshProjectBrowser
Returns if web project browser should refresh
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.IsBrowserDataClean(Autodesk.Revit.DB.Document)
Returns if project browser data clean
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.OnDoubleClick(Autodesk.Revit.DB.Document,System.Int32)
Double-click a tree item
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.DropTreeItem(System.Int32)
Drop tree item
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.BeginDragTreeItem
Drag tree item
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.ExpandOrCollapse(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{System.Int32},System.Boolean)
Set the selected tree item as expanded
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.ExpandInSearch(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{System.Int32})
Set the expanded items in search mode
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.SelectBrowserItems(System.Collections.Generic.IList{System.Int32})
Set the selected tree items in UI to internal
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetAllExpandedItemsIndex(Autodesk.Revit.DB.Document)
Returns all project browser expanded items' index
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetAllActiveItemsIndex(Autodesk.Revit.DB.Document)
Returns all project browser active items' index
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetAllExpandedItemsIndexInSearch(Autodesk.Revit.DB.Document)
Returns all project browser expanded items' index in search mode
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetAllSelectedItemsIndex(Autodesk.Revit.DB.Document)
Returns all project browser selected items' index
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider.GetAllBrowserItems(Autodesk.Revit.DB.Document)
Returns all project browser items
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.ProjectBrowserDataProvider
A class provides ProjectBrowser data.
Since:
2024